---
kind: other
id: Properties.T:Autodesk.Revit.DB.PrimarySizeCriterion
source: html/e924f1c5-622c-f7ed-4cdf-1ef35d51bba2.htm
---
# PrimarySizeCriterion Properties

Specifies whether the .NET object represents a valid Revit entity.